{
    "retroarch": {
        "package": "retroarch",
        "rom": 0,
        "options": 1,
        "arguements": {
            "-c/--config": "Path for config file. By default looks for config in $XDG_CONFIG_HOME/retroarch/retroarch.cfg, $HOME/.config/retroarch/retroarch.cfg, and $HOME/.retroarch.cfg.",
            "--appendconfig": "Extra config files are loaded in, and take priority over config selected in -c (or default). Multiple configs are delimited by ','.",
            "-L/--libretro": "Path to libretro implementation. Overrides any config setting.",
            "-g/--gameboy": "Path to Gameboy ROM. Load SuperGameBoy as the regular rom.",
            "-b/--bsx": "Path to BSX rom. Load BSX BIOS as the regular rom.",
            "-B/--bsxslot": "Path to BSX slotted rom. Load BSX BIOS as the regular rom.",
            "--sufamiA": "Path to A slot of Sufami Turbo. Load Sufami base cart as regular rom.",
            "--sufamiB": "Path to B slot of Sufami Turbo.",
            "-N/--nodevice": "Disconnects controller device connected to port (1 to 8).",
            "-A/--dualanalog": "Connect a DualAnalog controller to port (1 to 8).",
            "-m/--mouse": "Connect a mouse into port of the device (1 to 8).",
            "-p/--scope": "Connect a virtual SuperScope into port 2. (SNES specific).",
            "-j/--justifier": "Connect a virtual Konami Justifier into port 2. (SNES specific).",
            "-J/--justifiers": "Daisy chain two virtual Konami Justifiers into port 2. (SNES specific).",
            "-4/--multitap": "Connect a SNES multitap to port 2. (SNES specific).",
            "-P/--bsvplay": "Playback a BSV movie file.",
            "-R/--bsvrecord": "Start recording a BSV movie file from the beginning.",
            "-M/--sram-mode": "Takes an argument telling how SRAM should be handled in the session. {no,}load-{no,}: save describes if SRAM should be loaded, and if SRAM should be saved. Do note that noload-save implies that save files will be deleted and overwritten.",
            "-H/--host": "Host netplay as player 1.",
            "-C/--connect": "Connect to netplay as player 2.",
            "--port": "Port used to netplay. Default is 55435.",
            "-F/--frames": "Sync frames when using netplay.",
            "--spectate": "Netplay will become spectating mode. Host can live stream the game content to players that connect. However, the client will not be able to play. Multiple clients can connect to the host.",
            "--nick": "picks a nickname for use with netplay. Not mandatory.",
            "--command": "Sends a command over UDP to an already running RetroArch process. Available commands are listed if command is invalid.",
            "-r/--record": "Path to record video file. Using .mkv extension is recommended.",
            "--recordconfig": "Path to settings used during recording.",
            "--size": "Overrides output video size when recording with FFmpeg (format: WIDTHxHEIGHT).",
            "-v/--verbose": "Verbose logging.",
            "-U/--ups": "Specifies path for UPS patch that will be applied to ROM.",
            "--bps": "Specifies path for BPS patch that will be applied to ROM.",
            "--ips": "Specifies path for IPS patch that will be applied to ROM.",
            "--no-patch": "Disables all forms of rom patching.",
            "-X/--xml": "Specifies path to XML memory map.",
            "-D/--detach": "Detach RetroArch from the running console. Not relevant for all platforms."
        },

        "default_arguements": "-c /root/ignition/config/emulatos/retroarch.conf"
    }
}
